Мой дневник 
~~~
~~~2024-02-12 - 2024-02-26, Спринт 1~~~

2024-02-10.
Сегодня мы с командой распределили обязанности на проекте.
Мне была назначена роль фронтенд-разработчика, в частности, я буду заниматься вёрсткой.
Пока что это вся информация.

2024-02-12

Сегодня я приступила к изучению материалов по HTML и CSS. Погрузилась в основы этих языков, изучала их возможности и синтаксис.
Понимаю, что это ключевые инструменты для моей работы, поэтому хочу освоить их.

2024-02-14

Сегодня начала изучать, как устроена среда разработки Visual Studio Code (VS Code).
Разобралась с основными функциями, настройками и расширениями. Это мощный инструмент.

~~~2024-02-26 - 2024-03-11, Спринт 2~~~

2024-02-26

Сегодня разбиралась с тем, как работает GitHub.
Создала тестовый репозиторий, чтобы понять основные принципы работы с этой платформой. 
Практика помогла мне закрепить теоретические знания и лучше понять процесс управления версиями кода.

2024-02-27

Сегодня продолжила знакомиться с командой. 
Полноценное взаимодействие с коллегами состоялось только сегодня, и я получила возможность лучше понять их роли и задачи. 
Это важный шаг для слаженной командной работы и успешного выполнения проекта.

2024-03-02

Сегодня мне провели урок по фронтенд-разработке. 
Этот урок помог структурировать все ранее полученные знания, что значительно улучшило мое понимание и уверенность в работе. 
Теперь я чувствую себя более подготовленной к выполнению задач и готова применять новые знания на практике.

~~~2024-03-11 - 2024-03-25, Спринт 3~~~

2024-03-11

Сегодня мне дали первую задачу - сверстать карточку для пиццы. 
Начала составлять план своей работы, чтобы структурировать процесс и ничего не упустить. 
Это мой первый реальный проект, и я чувствую вдохновение и мотивацию.

2024-03-19

Задача оказалась тяжелее, чем я думала. 
Однако, у меня уже есть первые наброски кода. Продолжаю работать над улучшением и доработкой. 
Столкнулась с некоторыми сложностями, но стараюсь не сдаваться и искать решения. 

2024-03-22

Сегодня я попыталась разобраться, как кинуть в общий проект свой код. 
К сожалению, мои попытки оказались безуспешными. 
Поняла, что мне не хватает знаний по интеграции кода в общий репозиторий, и нужно больше практики.

2024-03-23

Влад помог мне разобраться, как внедрить мой код в общий проект. 
Сегодня я наконец-то смогла успешно интегрировать свою работу. 
Это был важный шаг, и я очень благодарна за помощь. 
Чувствую, что становлюсь более уверенной в своих силах и навыках.

~~~2024-03-25 - 2024-04-06, Спринт 4~~~

2024-03-29

Получила новую задачу - создание сетки для карточек с пиццей. 
Начала изучать контейнеры, так как понимаю, что это ключевой элемент для успешного выполнения задачи. 
Хочу убедиться, что мой код будет структурированным и эффективным.

2024-04-05

Сегодня удалось достичь значительного прогресса и добиться успеха. 
Это вдохновляет меня двигаться дальше и совершенствовать свои навыки.

2024-04-14

Сегодня вместе с Владом закоммитили еще одну часть моего кода. 
Эта задача далась мне нелегко, потребовалось много усилий и времени. 
Чувствую, что начинаю уставать, но радость от выполненной работы придает сил и уверенности.
Я очень благодарна ему за помощь. Без него мне было бы в разы тяжелее.

Седьмой спринт. 

2024-05-24

Я устала. Я взяла еще одну задачу, попыталась сама ее закоммитить и что-то сломала.
Вернуть все как было удалось, но задача не была выволнена. Жду указаний. 
